public class J03_반복문_월드컵개체년도구하기 {
    public static void main(String[] args) {
        // 2002 ~ 2100 까지 월드컵 개최년도를 출력하시오.
        // for 반복문 사용
         
        // System.out.println("////////// 방법1 /////////");
        //  for(int i=2002; i<=2100; i++){
        //     if((i-2002) % 4 ==0){
        //         System.out.println(i);
        //     }

        //  }
         // 결과
         // ---
         // 2002
        // 2006
        // 2010
        // 2014
        // 2018
        // 2022
        // 2026
        // 2030
        // 2034
        // 2038
        // 2042
        // 2046
        // 2050
        // 2054
        // 2058
        // 2062
        // 2066
        // 2070
        // 2074
        // 2078
        // 2082
        // 2086
        // 2090
        // 2094
        // 2098


        System.out.println("///////////// 방법2 /////////");
        for (int i=2002; i<=2100; i+=4){
            System.out.println(i);
        }   
    }
}
